# Pandas toturial part 2

what is going to be discussed is selecting specific values of a pandas DataFrame to work on.

#### What is an accessors?
As it interoduce itself, it gives access; when a class has an accessor, it allows to the private members be accessible on other scopes. the most simple examole of an accessor function could be the 'getter' and 'setter' of a function. These below are a few sample of accessors:

In [4]:
import array 
     
arr = array.array('i', [5, 1, 3, 4, 2, 2, 7])
 
# Accesses the index of the value in argument
print (arr.index(2))
 
# Accesses the number of time the
# stated value is present
print (arr.count(2))
 
# Mutates the array list
(arr.append(19))
 
# Prints the array after alteration
print (arr)

4
2
array('i', [5, 1, 3, 4, 2, 2, 7, 19])

To learn more about the accessors, [read here](https://www.geeksforgeeks.org/accessor-and-mutator-methods-in-python/).

---

Native Python objects provide good ways of indexing data. Pandas carries all of these over.
here is how to Access an Attribute of a **class** Instance:
Use the dot notation (.):

In [5]:
class Book:
    def __init__(self, title, author):
        self.title = title    # instance attribute
        self.author = author  # instance attribute

    def get_info(self):
        return f"'{self.title}' by {self.author}"


my_book = Book("1984", "George Orwell")
my_book

In [6]:
my_book.title

'1984'

In [7]:
my_book.author

'George Orwell'

and here is a sample of accessing a Value in a Dictionary:
Use the bracket notation with a key (\['key']):

In [8]:
# my_book['title']
my_book = {
    'title': '1984',
    'author': 'George Orwell',
    'year': 1949
}

my_book

{'title': '1984', 'author': 'George Orwell', 'year': 1949}

In [9]:
my_book['title']

'1984'

In [10]:
my_book['author']

'George Orwell'

---
Now, what does python accessors have to do with **pandas**? 
the answer is here: the dataFrames uses the dame way:

In [11]:
import pandas as pd
arr = pd.DataFrame({'scores': [20, 19, 18, 17], 'students': ['sam', 'pam', 'jym', 'kim']}, index=['rank1', 'rank2', 'rank3', 'rank4'])
arr

       scores students
rank1      20      sam
rank2      19      pam
rank3      18      jym
rank4      17      kim

now let's see how to access the values:
both ways of using (.) and ([]) are avialble here!

In [12]:
arr.scores

rank1    20
rank2    19
rank3    18
rank4    17
Name: scores, dtype: int64

In [13]:
arr['scores']

rank1    20
rank2    19
rank3    18
rank4    17
Name: scores, dtype: int64

here is another fun usage of the ([]) notation: accessing a single value, using the second ([]) notation that indicates the row number.

In [14]:
arr['scores']['rank3']

18

this is another way to relate the DataFrames in pandas and simple dictionries in python:

In [15]:
my_dict = {
    'scores': [20, 19, 18, 17],
    'students': ['sam', 'pam', 'jym', 'kim'],
    'last Name': ['do', 're', 'fa', 'sol']
}

table = pd.DataFrame(my_dict, index=['rank1', 'rank2', 'rank3', 'rank4'])
table

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re
rank3      18      jym        fa
rank4      17      kim       sol

here is a fun fact that shows a benefit of using ([]) rather that the (.): consider the last name that has an space (considerd as an special character). now the approach \['last Name'] is possible, but the .last Name is not possible!

In [16]:
table['last Name']

rank1     do
rank2     re
rank3     fa
rank4    sol
Name: last Name, dtype: object

---

### Indexing in pandas
pandas has its own accessor operators, *loc* (label-based selection) and *iloc* (index-based selection).
#### iloc:
the magicall indexes inside the braces, what are they? here is the format:

**\[start row: finish row: row count++ , start column: finish column, coulumn count++]**

In [17]:
table.iloc[0]

scores        20
students     sam
last Name     do
Name: rank1, dtype: object

In [18]:
table.iloc[0:2]

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re

In [19]:
table.iloc[0:3:2]

       scores students last Name
rank1      20      sam        do
rank3      18      jym        fa

In [20]:
table.iloc[0:3, 0]

rank1    20
rank2    19
rank3    18
Name: scores, dtype: int64

In [21]:
table.iloc[0:3, 1]

rank1    sam
rank2    pam
rank3    jym
Name: students, dtype: object

In [22]:
table.iloc[0:3, 0:2]

       scores students
rank1      20      sam
rank2      19      pam
rank3      18      jym

In [23]:
table.iloc[0:3, 0:3]

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re
rank3      18      jym        fa

In [24]:
table

       scores students last Name
rank1      20      sam        do
rank2      19      pam        re
rank3      18      jym        fa
rank4      17      kim       sol

could also be more creative about this indexing! like passing a list to indexes like below:

In [25]:
table.iloc[[0, 1, 3], [0, 2]]

       scores last Name
rank1      20        do
rank2      19        re
rank4      17       sol

what about negative numbers? should they scare us? No, they act like positive numbers, but starting from the **end** of the list!

In [26]:
table.iloc[-3:]

       scores students last Name
rank2      19      pam        re
rank3      18      jym        fa
rank4      17      kim       sol

#### loc: 

uses lables to iterate between defferent indexes.

In [27]:
table.loc['rank1', 'students']

'sam'

here is sth that might confuse you. the code like below:
```python
table.loc [0, 'students']
```
rises key error. why? becuase at the very time of the creation of that table, we manipulate the index as:
```python
index=['rank1', 'rank2', 'rank3', 'rank4'])
```
som the first index which is the row number, must now be a lable!

to make sure of understanding this consept, let's make a new dataframe:

In [28]:
new_table = pd.DataFrame({'notes': [0, 1, 2, 3], 'french':['do', 're', 'mi', 'fa']})
new_table.loc[0, 'french']

'do'

as it is shown above, there will not be any problem accessing the row number by its number, with **loc**, but we have to be carefull about the fact that changing the index of the DataFrame index might effect on accessing its attrebutes.

In [29]:
table.loc['rank1', ['scores', 'students']]

scores       20
students    sam
Name: rank1, dtype: object

In [30]:
table.loc[:, ['scores', 'students']]

       scores students
rank1      20      sam
rank2      19      pam
rank3      18      jym
rank4      17      kim

### what are pandas indexes anyway?
Basically, the row number is the index. to be more persice about that, Pandas makes indexes for any DataFrame (and Series?) by default, so that there could be reached if searched. like 0, 1, 2, ...

so now, what does **Indexing** mean? simply, that is assiging a **cloumn** of the real data, as the index so that it could be more meaningful and sometimes more accessible for spicific uses. below is shown how:

#### manipulating the index:
by using the **set_index** method, a column (or more than one) could be setted as the index lable.

this comes in handy for the privously mentioned probelm, when it was desired to use **loc** with first indexes of lables. consider this example below:

In [31]:
my_dict = {
    'id': ['hamed!@', 'hamid#$', 'ahmad@#'],
    'name': ['hamed', 'hamid', 'ahmad'],
    'pass': ['do', 're', 'mi']
}
my_df = pd.DataFrame(my_dict)
my_df

        id   name pass
0  hamed!@  hamed   do
1  hamid#$  hamid   re
2  ahmad@#  ahmad   mi

In [32]:
# my_df.loc[['hamed!@', 'hamid#$'], 'name']
# not possible above, because the fact that can't use labels as indexes, untill setting sth to index.
my_df.set_index('id', inplace=True)
my_df
# my_df.loc('hamid!@', 'name')

          name pass
id
hamed!@  hamed   do
hamid#$  hamid   re
ahmad@#  ahmad   mi

In [33]:
# my_df.loc['hamid!@', 'name']
my_df.loc[['hamed!@', 'hamid#$'], 'name']

id
hamed!@    hamed
hamid#$    hamid
Name: name, dtype: object

### what is multiIndexing?
In pandas, there is a term named multiIndexing, using assinmednt of more than one column to a DataFrame as index.
like this:

In [36]:
my_dict = {
    'id': ['hamed!@', 'hamid#$', 'ahmad@#'],
    'name': ['hamed', 'hamid', 'ahmad'],
    'pass': ['do', 're', 'mi']
}
my_df = pd.DataFrame(my_dict)
my_df.set_index(['id', 'name'], inplace=True)
my_df

              pass
id      name
hamed!@ hamed   do
hamid#$ hamid   re
ahmad@# ahmad   mi

In [37]:
my_df.reset_index()

        id   name pass
0  hamed!@  hamed   do
1  hamid#$  hamid   re
2  ahmad@#  ahmad   mi

---

### selectiong by logic
what if it was desired to find the very thing that has been searched for? here is the ansower: use the dot notation (.) to choose the column names, and use the '==' to check for the data.

In [ ]:
my_dict = {
    'scores': [20, 19, 18, 17],
    'students': ['sam', 'pam', 'sam', 'kim'],
    'last Name': ['do', 're', 'fa', 'sol']
}

table = pd.DataFrame(my_dict, index=['rank1', 'rank2', 'rank3', 'rank4'])
table.students == 'sam'

and here is how to show the only filterd data:

In [ ]:
table.loc[table.students == 'sam']

you could also be more creative about logical index searching!

In [ ]:
table.loc[(table.students == 'sam') & (table['last Name'] == 'do')]

### Pandas built-in conditional selectors
the **isin**, which lets you select data whose value "is in" a list of values.

In [ ]:
table.loc[table.students.isin(['sam'])]

In [ ]:
table.loc[(table.students.isin(['sam'])) & (table['last Name'].isin(['do']))]

## How to assign data to DataFrame?
answer: easily! review these examples below:

In [ ]:
table['new column'] = ['column1', 'column2', 'column3', 'column4']

In [ ]:
table

In [ ]:
table.loc[(table.students == 'sam') & (table['last Name'] == 'do'), 'scores'] = 16
table